#Область ПрограммныйИнтерфейс
 
 //добавление во все формы поля Контактное лицо, в форму Заказ покупателя дополнительно поле - Согласованная скидка   
 // определение события При изменении Скидки и Кнопку "Пересчитать документ с учетом скидки"
 
Процедура ДополнитьФорму(Форма) Экспорт

	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма); 
		ДобавитьПолеСогласованнаяСкидка(Форма); 
		ДобавитьКнопкуКомандыПересчитатьДокументСУчетомСкидки(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);   
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);  
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);   
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
 
	КонецЕсли;
   
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции       

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо";    
	
КонецПроцедуры   

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)

	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо"; 	
 
КонецПроцедуры  

Процедура ДобавитьПолеСогласованнаяСкидка(Форма)
	
	
	Группа = Форма.Элементы.Добавить("ГруппаШапкаСкидка", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		
	ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаСкидка);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.СогласованнаяСкидка";
	ПолеВвода.УстановитьДействие("ПриИзменении", "СогласованнаяСкидкаПриИзменении");

КонецПроцедуры    

Процедура ДобавитьКнопкуКомандыПересчитатьДокументСУчетомСкидки(Форма)
	
	Команда = Форма.Команды.Добавить("ПересчитатьДокументСУчетомСкидки");
	Команда.Заголовок = "Пересчитать документ с учетом скидки";
	Команда.Действие = "ПересчитатьДокументСУчетомСкидки";
	
	КнопкаФормы = Форма.Элементы.Добавить("КнопкаПересчитатьДокументСУчетомСкидки", Тип("КнопкаФормы"), Форма.Элементы.ГруппаШапкаСкидка);
	КнопкаФормы.ИмяКоманды = "ПересчитатьДокументСУчетомСкидки";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка; 	

КонецПроцедуры    

#КонецОбласти
